testCase/results/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    Wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       1540;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1600;
        startFace       1640;
    }
    atmosphere
    {
        type            patch;
        nFaces          20;
        startFace       3240;
    }
)

// ************************************************************************* //
