testCase/results/0/wBA_l.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      wBA_l.org;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0; 

boundaryField
{
   Wall       
    {
        type            zeroGradient;
    }

    atmosphere      
    {
	type		zeroGradient;
    }

axis1
	{
		type    symmetryPlane;
	}
axis2
	{
		type    symmetryPlane;
	}
    frontAndBack    
    {
        type            empty;
    }
}


// ************************************************************************* //
