testCase/results/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Fields to be probed. runTime modifiable!
        fields
        (   
            M0
            M1
            M2
            mZero
            mOne
            mTwo
            node0
            node1
            weight0
            weight1
            rho_foam
            TS
            // wBA_g
            // wCO2_g
        );


// Locations to be probed. runTime modifiable!
        probeLocations
        (
            ( 0.05 0.01 0.005 ) // P1
           // ( 0.05 0.05 0.01 )  // P2
            //( 0.05 0.1 0.01 )   // P3
            //( 0.05 0.15 0.01 )   // P4
            // (0.0425 0.01 0.0005) // p1
            // (0.0425 0.02 0.0005) // p2
            // (0.0425 0.03 0.0005) // p3
            // (0.0425 0.04 0.0005) // p4
            // (0.0425 0.05 0.0005) // p5
            // (0.0425 0.06 0.0005) // p6
            // (0.0425 0.07 0.0005) // p7
            // (0.0425 0.08 0.0005) // p8
            // (0.0425 0.09 0.0005) // p9
            // (0.0425 0.10 0.0005) // p10
            // (0.0425 0.11 0.0005) // p11
            // (0.0425 0.12 0.0005) // p12
            // (0.0425 0.13 0.0005) // p13
            // (0.0425 0.14 0.0005) // p14
            // (0.0425 0.15 0.0005) // p15
            // (0.0425 0.16 0.0005) // p16
            // (0.0425 0.17 0.0005) // p17
            // (0.0425 0.18 0.0005) // p18
            // (0.0425 0.19 0.0005) // p19
            // (0.0425 0.20 0.0005) // p20

        );


// ************************************************************************* //
